app/controllers/api/v1/notebooks_controller.rb

SELECT "notebooks".* FROM "notebooks"
---
  def index
    @notebooks = Notebook.all

INSERT INTO "notebooks" ("name", "isbn", "authors", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "testing1121"], ["isbn", "hellotester"], ["authors", "{Opener1,Opener2}"], ["created_at", "2019-06-20 12:57:00.275347"], ["updated_at", "2019-06-20 12:57:00.275347"]]
---
  def create
    @notebook = Notebook.new(notebook_params)

    if @notebook.save!

UPDATE "notebooks" SET "name" = $1, "authors" = $2, "updated_at" = $3 WHERE "notebooks"."id" = $4  [["name", "Testing121"], ["authors", "{test1,test2}"], ["updated_at", "2019-06-21 12:37:16.865467"], ["id", 2]]
---
  def update
    if @notebook.update(notebook_params)

DELETE FROM "notebooks" WHERE "notebooks"."id" = $1  [["id", 1]]
---
  def destroy
    @notebook.destroy

SELECT  "notebooks".* FROM "notebooks" WHERE "notebooks"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---
    def set_notebook
      @notebook = Notebook.find(params[:id])